lang/scheme/learning-scheme.org
#+title:  learning scheme

* r5rs

*** output

    當想要把數據輸出到已經存在的文件時就會報錯

    #+begin_src scheme
    (output-port? <obj>)

    (current-output-port)

    (open-output-file <file-name>)
    ;; 這個表達式幾乎只有被賦予給一個名字時纔有意義
    ;; 而下面的東西卻是這個表達式的匿名版本
    ;; 也就是直接把這個表達式所返回port作爲別的函數的參數

    (call-with-output-file <file-name> (lambda (x) <body>))
    ;; 如果被call的函數不返回
    ;; 這裏所創建的port就不關閉
    ;; 這樣就可以用call/cc在不同io之間跳來跳去

    (with-output-to-file <file-name> (lambda () <body>))
    ;; 在<body>內 (current-output-port)將被臨時改變爲這裏所指定的port
    ;; 例如下面的測試:
    ;; (with-output-to-file "sss.scm"
    ;;   (lambda () (current-output-port)))
    ;; 這樣在<body>內就將(read <port>)與(write <obj> <port>)的使用
    ;; 簡化爲了:(read)與(write <obj>)

    (close-output-port <port>)
    #+end_src

*** input

    #+begin_src scheme
    (input-port? <obj>)
    (current-input-port)
    (open-input-file <file-name>)
    (close-input-port <port>)

    (call-with-input-file <file-name> (lambda (x) <body>))
    (with-input-to-file <file-name> (lambda () <body>))

    ;; 兩個例子
    (define (read-file file-name)
      (let ([p (open-input-file file-name)])
        (let loop ([ls1 '()]
                   [c (read-char p)])
          (if (eof-object? c)
            (begin
              (close-input-port p)
              (list->string (reverse ls1)))
            (loop (cons c ls1) (read-char p))))))

    (define (read-file file-name)
      (with-input-from-file file-name
        (lambda ()
          (let loop ([ls1 '()]
                     [c (read-char)])
            (if (eof-object? c)
              (list->string (reverse ls1))
              (loop (cons c ls1) (read-char)))))))

    (read-file "io-of-scheme.org")
    (define kkk (open-input-file "io-of-scheme.org"))
    (read-char kkk)


    ;; 下面的read讀到的是sexp
    (read kkk)
    (define (s-read file-name)
      (with-input-from-file file-name
        (lambda ()
          (let loop ((ls1 '()) (s (read)))
            (if (eof-object? s)
              (reverse ls1)
              (loop (cons s ls1) (read)))))))
    #+end_src

*** play with io

    read與write特別適合用來處理包含scheme代碼的文件

    #+begin_src scheme
    (read)
    (read-char)
    (peek-char)


    (define lll (open-input-file "lll.scm"))


    (read lll)
    (read-char lll)
    (peek-char lll)


    (close-input-port lll)

    ;; 下面的r5rs中的東西是ikarus中沒有的
    ;; (char-ready?)
    ;; (char-ready? lll)

    ;; --------------------------------------------
    ;; (write obj port)
    ;; It outputs the obj to the port
    ;; Strings are enclosed in double quotes
    ;; and characters are combined with the #\

    ;; (display obj port)
    ;; It outputs the obj to the port
    ;; Strings are not enclosed in double quotes
    ;; nd characters are not combined with the #\

    ;; (newline port)
    ;; It begins a new line

    ;; (write-char char port)
    ;; It outputs the char to the port

    (define ooo (open-output-file "ooo.scm"))
    (define iii (open-input-file "ooo.scm"))

    (write '(1 2 3))
    (newline)

    (write "123")
    (display "123")

    (write '(1 2 3) ooo)
    (read iii)

    (newline ooo)

    (write-char #\1)
    (write-char #\1 ooo)
    #+end_src

*** system interface

    #+begin_src scheme
    (load "k1.scm")
    (transcript-on "fff")
    (transcript-off)
    #+end_src

* r6rs

*** condition type

    &i/o              condition type
    (make-i/o-error)      procedure
    (i/o-error? obj)     procedure

    #+begin_src scheme
    (make-i/o-error)
    (i/o-error? 1)
    (i/o-error? (make-i/o-error))

    (define-condition-type &i/o &error
      kkk kkk?)
    (kkk)
    (kkk? 1)
    (kkk? (kkk))
    #+end_src


    &i/o-read              condition type
    (make-i/o-read-error)      procedure
    (i/o-read-error? obj)     procedure
    #+begin_src scheme
    (make-i/o-read-error)
    (i/o-read-error? 1)
    (i/o-read-error? (make-i/o-read-error))

    ;; 注意這裏的定義是在形成一個錯誤類型的等級系統
    ;; 這一節的所有內容都是如此 沒啥意思
    ;; 這樣設計是爲了更好的報錯
    (define-condition-type &i/o-read &i/o
      kkk kkk?)
    (kkk)
    (kkk? 1)
    (kkk? (kkk))
    #+end_src

*** buffer modes

    #+begin_src scheme
    (buffer-mode none)
    (buffer-mode line)
    (buffer-mode block)
    #+end_src

*** >< port (funny)

    file name :: string
    file option :: (file-options <symbol>)

    #+begin_src scheme
    (file-options no-create)
    (open-file-input-port "kkk" (file-options no-create))
    (open-file-input-port "kkk")
    (input-port? (open-file-input-port "kkk"))
    (standard-input-port)
    (get-u8 (open-file-input-port "kkk"))
    (get-bytevector-n (open-file-input-port "kkk") 10)
    (get-bytevector-n (standard-input-port) 10)
    (get-bytevector-some (open-file-input-port "/home/xyh/.xinitrc"))
    (get-bytevector-n (open-file-input-port "/home/xyh/.xinitrc") 100)

    (open-string-input-port "string")
    (current-input-port)
    (get-char (current-input-port))
    (get-char (open-string-input-port "string"))
    (get-string-n (open-string-input-port "string") 6)
    (get-string-n (current-input-port) 10)
    #+end_src

*** simple i/o

    #+begin_src scheme
    (eof-object)
    (eof-object? obj)

    (call-with-output-file file-name proc)
    (call-with-input-file "kkk" (lambda (x) 1))
    (call-with-input-file "kkk" (lambda (x) x))

    (current-input-port)
    (current-output-port)
    (current-error-port)

    (with-input-from-file file-name thunk)
    (with-output-to-file file-name thunk)

    (input-port? obj)
    (output-port? obj)

    (open-output-file "kkk") ;; 準備從scheme向外寫入一個文件
    (open-input-file "kkk") ;; 準本讀取一個文件到scheme內

    (read-char)
    (read-char (open-input-file "kkk"))
    (read-char (current-input-port))
    (read-char (open-input-file "schemer.org"))

    (read)
    (read (open-input-file "schemer.org"))

    (write-char #\1)
    (write-char #\1 (open-output-file "l"))

    (display 1)
    (set! kkk (open-output-file "kkk"))
    (display '() kkk)
    (display (lambda (x) x) kkk)

    (write 1)
    (write 1 kkk)
    (write (lambda (x) x) kkk)

    (close-output-port kkk)


    (close-input-port (open-input-file "llll"))
    (close-output-port (open-output-file "lllll"))
    #+end_src

*** file system

    #+begin_src scheme
    (file-exists? <file-name-string>)
    (delete-file <file-name-string>)
    #+end_src

*** command-line access and exit values

    #+begin_src scheme
    (command-line)

    (exit)
    (exit <obj>)
    #+end_src

* r7rs

*** record-type

    #+begin_src scheme
    (define-record-type <pare>
      (kons x y)
      pare?
      (x kar set-kar!)
      (y kdr))

    (pare? (kons 1 2))
    (pare? (cons 1 2))
    (kar (kons 1 2))
    (kdr (kons 1 2))
    (let ((k (kons 1 2)))
      (set-kar! k 3)
      (kar k))
    #+end_src

