out/lang/scheme/learning-scheme.org.html
    (define-library (example grid)
      (export make rows cols ref each
              (rename put! set!))
      (import (scheme base))
      (begin

        ;; Create an NxM grid.
        (define (make n m)
          (let ((grid (make-vector n)))
            (do ((i 0 (+ i 1)))
                ((= i n) grid)
              (let ((v (make-vector m #false)))
                (vector-set! grid i v)))))

        (define (rows grid)
          (vector-length grid))

        (define (cols grid)
          (vector-length (vector-ref grid 0)))

        ;; Return #false if out of range.
        (define (ref grid n m)
          (and (&lt; -1 n (rows grid))
               (&lt; -1 m (cols grid))
               (vector-ref (vector-ref grid n) m)))

        (define (put! grid n m v)
          (vector-set! (vector-ref grid n) m v))

        (define (each grid proc)
          (do ((j 0 (+ j 1)))
              ((= j (rows grid)))
            (do ((k 0 (+ k 1)))
                ((= k (cols grid)))
              (proc j k (ref grid j k)))))

        ))

    (define-library (example life)
      (export life)
      (import (except (scheme base) set!)
              (scheme write)
              (example grid))
      (begin

        (define (life-count grid i j)
          (define (count i j)
            (if (ref grid i j) 1 0))
          (+ (count (- i 1) (- j 1))
             (count (- i 1) j)
             (count (- i 1) (+ j 1))
             (count i (- j 1))
             (count i (+ j 1))
             (count (+ i 1) (- j 1))
             (count (+ i 1) j)
             (count (+ i 1) (+ j 1))))

        (define (life-alive? grid i j)
          (case (life-count grid i j)
            ((3) #true)
            ((2) (ref grid i j))
            (else #false)))

        (define (life-print grid)
          (display &quot;\x1B;[1H\x1B;[J&quot;) ; clear vt100
          (each grid
                (lambda (i j v)
                  (display (if v &quot;*&quot; &quot; &quot;))
                  (when (= j (- (cols grid) 1))
                    (newline)))))

        (define (life grid iterations)
          (do ((i 0 (+ i 1))
               (grid0 grid grid1)
               (grid1 (make (rows grid) (cols grid))
                      grid0))
              ((= i iterations))
            (each grid0
                  (lambda (j k v)
                    (let ((a (life-alive? grid0 j k)))
                      (set! grid1 j k a))))
            (life-print grid1)))

        ))


    ;; Main program.
    (import (scheme base)
            (only (example life) life)
            (rename (prefix (example grid) grid-)
                    (grid-make make-grid)))

    ;; Initialize a grid with a glider.
    (define grid (make-grid 24 24))
    (grid-set! grid 1 1 #true)
    (grid-set! grid 2 2 #true)
    (grid-set! grid 3 0 #true)
    (grid-set! grid 3 1 #true)
    (grid-set! grid 3 2 #true)
    ;; Run for 80 iterations.
    (life grid 80)
    #+end_src

* ikarus

*** The (ikarus) library

***** port-mode

      #+begin_src scheme
      (define kkk-port (open-output-file &quot;kkk.scm&quot;))

      (port-mode kkk-port)

      (set-port-mode! kkk-port &apos;r6rs-mode)
      (set-port-mode! kkk-port &apos;ikarus-mode)
      #+end_src

***** #!eof in ikarus-mode

      #+begin_src scheme
      (eof-object)

      (eof-object? &apos;#!eof)
      (eof-object? #!eof)
      #+end_src

      :tangle kkk.scm
      #+begin_src scheme
      #!/usr/bin/env scheme-script
      (import (ikarus))
      (display &quot;kkk\n&quot;)
      (display &quot;goodbye\n&quot;)
      #!eof

      &lt;some junk&gt;
      #+end_src

***** parameters

      #+begin_src scheme
      (define *screen-width* 72)
      (define screen-width
        (case-lambda
          [() *screen-width*]
          [(x) (set! *screen-width* x)]))

      (make-parameter &lt;val&gt; &lt;filter&gt;)

      (define kkk (make-parameter x f))
      (kkk &lt;val&gt;)
      ==
      (define kkk (make-parameter x))
      (kkk (f &lt;val&gt;))


      (define screen-width
        (make-parameter 72))

      (define screen-width
        (make-parameter 72
          (lambda (w)
            (assert (and (integer? w) (exact? w)))
            (max w 1))))
      (screen-width)
      (screen-width -10)
      (screen-width 0.1)
      (screen-width &quot;1&quot;)

      (parameterize ([&lt;parameter1&gt; &lt;val1&gt;]
                     ...)
        body body* ...)
      ;; whenever control exits the body of a parameterize expression
      ;; the value of the parameter is reset back to
      ;; what it was before the body expressions were entered

      (define terminal-property
        (make-parameter &quot;0&quot;
          (lambda (x)
            (display &quot;\x1b;[&quot;)
            (display x)
            (display &quot;m&quot;)
            x)))

      (begin
        (display &quot;Normal and &quot;)
        (parameterize ([terminal-property &quot;41;37&quot;])
          (display &quot;RED!&quot;))
        (newline))

      (terminal-property)
      #+end_src

***** &gt;&lt; local library imports

      By locally importing a library into the appropriate scope
      we gain the ability to delete the import form
      when the procedure that was using it is deleted

      The syntax of the local import form
      is similar to the import
      that appears at the top of a library or a script form

      and carries with it the same restrictions:
      1. no identifier name may be imported twice unless it denotes the same identifier
      2. no identifier may be both imported and defined
      3. and imported identifiers are immutable (這個限制尤其r6rs是設計上的失敗)

      Local import forms are useful for two reasons:
      1) they minimize the namespace clutter
         that usually occurs when many libraries are imported at the top level
      2) they limit the scope of the import
         and thus help modularize a library&apos;s dependencies

      模塊系統的目的是爲了管理命名空間
      我想模塊系統就可以是簡單的對代碼的動態處理
      這樣就給了模塊行系統無限的靈活性
      當我加載一個模塊的時候
      就是簡單的載入那個模塊的代碼
      同時加上一些明顯的對命名空間的管理就行了
      但是爲什麼人們不這樣去實現模塊系統呢?因爲效率的問題嗎??
      如何用有向圖來實現模塊系統???

***** &gt;&lt; gensyms

      這個東西可以用來處理約束變元
      然而有向圖的使用可以繞過對約束變元的處理

      #+begin_src scheme
      (define kkk (gensym &quot;kkk&quot;))
      (symbol-&gt;string kkk)
      (gensym? kkk)
      (define kkk (gensym &apos;kkk))
      (gensym-&gt;unique-string kkk)

      &apos;#{unique-name}
      &apos;#{pretty-name unique-unique-name}
      &apos;#:pretty-name
      #+end_src

***** printing

******* pretty-print

        The procedure pretty-print is intended for printing Scheme data
        typically Scheme programs
        in a format close to how a Scheme programmer would write it
        Unlike write, which writes its input all in one line
        pretty-print inserts spaces and newlines in order to produce more pleasant output

        #+begin_src scheme
        ;; (pretty-print datum)
        ;; (pretty-print datum output-port)

        (pretty-print 1)

        (define compile-port
          (make-parameter
           (current-output-port)
           (lambda (p)
             (unless (output-port? p)
               (error &apos;compile-port &quot;not an output port ~s&quot; p))
             p)))
        (pretty-print 1 (compile-port))


        (define fact-code
          &apos;(letrec ([fact (lambda (n) (if (zero? n) 1 (* n (fact (- n 1)))))])
             (fact 5)))
        (pretty-print fact-code)

        ;; (letrec ((fact
        ;;           (lambda (n) (if (zero? n) 1 (* n (fact (- n 1)))))))
        ;;   (fact 5))

        ;; Limitations: As shown in the output above
        ;; the current implementation of pretty-print
        ;; does not handle printing of square brackets properly
        #+end_src

******* pretty-width
