lang/scheme/learning-scheme.org
******* pretty-width

        一個控制pretty-print的輸出寬度的參數

        Note that pretty-width does not guarantee that
        the output will not extend beyond the specified number
        Very long symbols, for examples, cannot be split into multiple lines
        and may force the printer to go beyond the value of pretty-width

        #+begin_src scheme
        ;; (pretty-width)
        ;; (pretty-width n)

        (pretty-width 60)

        (parameterize ([pretty-width 40])
          (pretty-print fact-code))
        ;; (letrec ((fact
        ;;           (lambda (n)
        ;;             (if (zero? n)
        ;;                 1
        ;;                 (* n (fact (- n 1)))))))
        ;;   (fact 5))
        #+end_src

******* format & printf & fprintf

        1. format
           #+begin_src scheme
           ;; (format fmt-string args ...)

           ;; ~s -- (write)
           (format "kkk~skkk" "lll")
           ;; "kkk\"lll\"kkk"
           (format "kkk~skkk" #\l)
           ;; "kkk#\\lkkk"

           ;; ~a -- (display)
           (format "kkk~akkk" "lll")
           ;; "kkklllkkk"
           (format "kkk~akkk" #\l)
           ;; "kkklkkk"


           ;; ~b -- binary representation (of exact number)
           ;; Note that the #b numeric prefix is not produced in the output
           (format "kkk~bkkk" #b1000)
           (format "kkk~bkkk" 8)
           ;; "kkk1000kkk"

           ;; ~o 8進制
           ;; ~x 16進制
           ;; ~d 10進制
           ;; Note that the #b, #o, and #x numeric prefixes
           ;; are not added to the output when ~b, ~o, and ~x are used

           ;; ~~ -- ~
           (format "kkk~~kkk")


           (format "message: ~s, ~s, and ~s\n" 'symbol "string" #\c)
           ;; "message: symbol, \"string\", and #\\c\n"
           (format "message: ~a, ~a, and ~a\n" 'symbol "string" #\c)
           ;; "message: symbol, string, and c\n"
           #+end_src
        2. printf
           The procedure printf is similar to format except that the output is sent to the
           current-output-port instead of being collected in a string
           #+begin_src scheme
           ;; (printf fmt-string args ...)
           (define kkk (format "message: ~a, ~a, and ~a\n" 'symbol "string" #\c))
           (define kkk (printf "message: ~a, ~a, and ~a\n" 'symbol "string" #\c))
           #+end_src
        3. fprintf
           The procedure fprintf is similar to printf
           except that the output port to which the output is sent is specified as the first argument
           #+begin_src scheme
           ;; (fprintf output-port fmt-string args ...)

           (define compile-port
             (make-parameter
              (current-output-port)
              (lambda (p)
                (unless (output-port? p)
                  (error 'compile-port "not an output port ~s" p))
                p)))

           (fprintf (compile-port) "message: ~a, ~a, and ~a\n" 'symbol "string" #\c)
           #+end_src

******* print-graph
        The graph notation is a way of marking and referencing parts of a data structure
        and, consequently
        creating shared and cyclic data structures at read time
        instead of resorting to explicit mutation at run time
        + 即 '(#0=(1 2) #0# #0# #0#)和'#0=(1 #0# #0# #0#)
          這種東西也能被ikarus讀到
          並且按我的意圖處理
          但是輸入#0=(1 . #0#)會讓內存溢出
        + 這也是digrap希望作的
          digrap希望的正是把這一點做到極致

        The #n= marks the following data structure with mark n
        where n is a nonnegative integer
        The #n# references the data structure marked n
        Marks can be assigned and referenced in any order
        but each mark must be assigned to exactly once in an expression
        + 對#0=的讀取總是能成功的
          並不受下面的print-graph parameter的影響
          這個參數影響的是打印方式


        The print-graph parameter controls how the writers
        + e.g. pretty-print and write
        handle shared and cyclic data structures
        In Ikarus, all writers detect cyclic data structures
        and they all terminate on all input, cyclic or otherwise

        這些writers (即寫入函數)
        名字叫`打印'或者`顯示'
        而其實是一個讀程序員所指示的數據
        然後把這些數據寫入port (即端口)
        #+begin_src scheme
        (print-graph)
        (print-graph #f)
        (print-graph #t)

        (parameterize ([print-graph #f])
          (let ([x (list 1 2 3 4)])
            (pretty-print (list x x x))))
        ;; ((1 2 3 4) (1 2 3 4) (1 2 3 4))
        (parameterize ([print-graph #t])
          (let ([x (list 1 2 3 4)])
            (pretty-print (list x x x))))
        ;; (#0=(1 2 3 4) #0# #0#)


        (print-graph #f)
        (print-graph #t)
        '(#0=(1 2 3 4) #0# #0#)
        '((1 2 3 4) (1 2 3 4) (1 2 3 4))

        (last-pair '(1 2 1 2 1 2))
        (last-pair '(1 2 1 2 1 2 . 12))

        ;; 下面的結果是bug嗎???
        (parameterize ([print-graph #f])
          (let ([x (list 1 2)])
            (let ([y (list x x x x)])
              (set-car! (last-pair y) y)
              (pretty-print (list y y)))))
        ;; (#0=((1 2) (1 2) (1 2) #0#) #0#)
        (parameterize ([print-graph #t])
          (let ([x (list 1 2)])
            (let ([y (list x x x x)])
              (set-car! (last-pair y) y)
              (pretty-print (list y y)))))
        ;; (#0=(#1=(1 2) #1# #1# #0#) #0#)

        ;; 僅僅是打印上的區別??
        ;; 還是整個複製過程的行爲都改變了???
        (parameterize ([print-graph #f])
          (let ([x (list 1 2)])
            (let ([y (list x x x x)])
              (pretty-print y)
              (pretty-print (car y))
              (pretty-print (cadr y))
              (eq? (car y) (cadr y)))))

        (parameterize ([print-graph #t])
          (let ([x (list 1 2)])
            (let ([y (list x x x x)])
              (pretty-print y)
              (pretty-print (car y))
              (pretty-print (cadr y))
              (eq? (car y) (cadr y)))))


        ;; 不論如何'(#0=(1 2) #0# #0# #0#)這種東西
        ;; 都能直接被ikarus讀到 並且正確處理
        ;; 我需要學習的就是ikarus處理這些marked表達式的方式
        (parameterize ([print-graph #t])
          (let ([y '(#0=(1 2) #0# #0# #0#)])
            (pretty-print y)
            (eq? (car y) (cadr y))
            y))
        (parameterize ([print-graph #f])
          (let ([y '(#0=(1 2) #0# #0# #0#)])
            (pretty-print y)
            (eq? (car y) (cadr y))
            y))
        #+end_src

******* >< print-gensym

******* >< gensym-prefix

******* >< gensym-count

***** >< tracing

***** >< timing

*** >< The (ikarus ipc) library

***** environment variables

      when the operating system starts a process
      it starts the process in some environment
      that maps environment variables to values

      #+begin_src scheme
      (import (ikarus ipc))

      ;; (getenv key)

      (getenv "HOME")
      (getenv "PATH")
      (getenv "KKK")
      (getenv "IKARUS_LIBRARY_PATH")

      ;; (setenv key value)
      ;; (setenv key value overwrite?)

      (setenv "KKK" "123")
      (setenv "KKK" "12" #f)


      ;; (unsetenv key)

      (unsetenv "KKK")
      #+end_src

***** >< subprocess communication

      starting subprocesses
      sending and receiving data through
      the subprocesses' standard input, output, and error ports

      #+begin_src scheme

      #+end_src

***** >< TCP and UDP sockets

      #+begin_src scheme

      #+end_src

*** The (ikarus foreign) library

***** note

      (import (rnrs))
      (import (ikarus))
      上面兩個是ikarus自帶的
      不用去系統裏搜索就能夠被加載

      #+begin_src scheme
      (import (ikarus foreign))
      #+end_src

