lang/scheme/learning-scheme.org
***** Memory operations

      #+begin_src scheme
      (import (ikarus foreign))

      ;; memory allocate
      (define kkk (malloc 1))
      ;; #<pointer #x000000000161F170>
      ;; 我的系統的地址是2bytes(16位)16進制數 因此是64-bit系統

      ;; 對內存的收回當然也要自己管理
      (free kkk)
      ;; 兩次free一個指針就會讓系統崩潰
      ;; 所以應該加上一層來保護對free的使用

      (pointer->integer kkk)

      (integer->pointer (pointer->integer kkk))

      (pointer? kkk)

      (pointer-set-c-char! kkk 1 10)

      (pointer-ref-c-signed-char kkk 1)

      #b10
      #o10
      #x10

      (let ([p (malloc 3)])
        (pointer-set-c-char! p 0 #b01111111)
        (pointer-set-c-char! p 1 #b10000000)
        (pointer-set-c-char! p 2 #b11111111)
        (let ([result
               (list (pointer-ref-c-signed-char p  0)
                     (pointer-ref-c-signed-char p 1)
                     (pointer-ref-c-signed-char p 2)
                     (pointer-ref-c-unsigned-char p 0)
                     (pointer-ref-c-unsigned-char p 1)
                     (pointer-ref-c-unsigned-char p 2))])
          (free p)
          result))
      (127 -128 -1 127 128 255)
      #+end_src

***** accessing foreign objects from scheme

      echo $LD_LIBRARY_PATH
      man dlopen
      man dlclose
      man dlerror
      man dlsym

      #+begin_src scheme
      (import (ikarus foreign))


      (dlopen) ;; dynamically load

      (dlopen library-name)
      (dlopen library-name lazy? global?)


      (dlclose library-pointer)


      (dlerror)


      (dlsym library-pointer string)
      #+end_src
      dlclose之後在引用被輸出的名字就可能讓程序崩潰
      所以應該加上一層來保護這些對dlclose的使用

***** calling out to foreign procedures

      #+begin_src scheme
      (import (ikarus foreign))


      ((make-c-callout return-type parameter-types) native-pointer)


      (define libm (dlopen "/lib/libm.so"))
      libm
      ;; #<pointer #x00007FE9413F19B0>
      (define libm-atan-ptr (dlsym libc "atan"))
      libc-atan-ptr
      ;; #<pointer #x00007FE940A6A730>
      (define libm-atan
        ((make-c-callout 'double '(double)) libm-atan-ptr))
      libm-atan

      (libm-atan 1.0)
      ;; 0.7853981633974483
      (libm-atan 1)
      ;; Unhandled exception
      ;;  Condition components:
      ;;     1. &assertion
      ;;     2. &who: callout-procedure
      ;;     3. &message: "argument does not match type double"
      ;;     4. &irritants: (1)
      #+end_src

***** calling back to scheme

      #+begin_src scheme
      (import (ikarus foreign))


      ((make-c-callback return-type parameter-types) scheme-procedure)


      ;; The following segment illustrates a very inefficient way of
      ;; extracting the lowermost 32 bits from an exact integer
      (format "~x"
              (((make-c-callout 'unsigned-int '(unsigned-int))
                ((make-c-callback 'unsigned-int '(unsigned-int))
                 values))
               #xfedcba09876543210fedcba09876543210))
      ;; "76543210"
      #+end_src
