out/lang/scheme/learning-scheme.org.html

***** Memory operations

      #+begin_src scheme
      (import (ikarus foreign))

      ;; memory allocate
      (define kkk (malloc 1))
      ;; #&lt;pointer #x000000000161F170&gt;
      ;; 我的系統的地址是2bytes(16位)16進制數 因此是64-bit系統

      ;; 對內存的收回當然也要自己管理
      (free kkk)
      ;; 兩次free一個指針就會讓系統崩潰
      ;; 所以應該加上一層來保護對free的使用

      (pointer-&gt;integer kkk)

      (integer-&gt;pointer (pointer-&gt;integer kkk))

      (pointer? kkk)

      (pointer-set-c-char! kkk 1 10)

      (pointer-ref-c-signed-char kkk 1)

      #b10
      #o10
      #x10

      (let ([p (malloc 3)])
        (pointer-set-c-char! p 0 #b01111111)
        (pointer-set-c-char! p 1 #b10000000)
        (pointer-set-c-char! p 2 #b11111111)
        (let ([result
               (list (pointer-ref-c-signed-char p  0)
                     (pointer-ref-c-signed-char p 1)
                     (pointer-ref-c-signed-char p 2)
                     (pointer-ref-c-unsigned-char p 0)
                     (pointer-ref-c-unsigned-char p 1)
                     (pointer-ref-c-unsigned-char p 2))])
          (free p)
          result))
      (127 -128 -1 127 128 255)
      #+end_src

***** accessing foreign objects from scheme

      echo $LD_LIBRARY_PATH
      man dlopen
      man dlclose
      man dlerror
      man dlsym

      #+begin_src scheme
      (import (ikarus foreign))


      (dlopen) ;; dynamically load

      (dlopen library-name)
      (dlopen library-name lazy? global?)


      (dlclose library-pointer)


      (dlerror)


      (dlsym library-pointer string)
      #+end_src
      dlclose之後在引用被輸出的名字就可能讓程序崩潰
      所以應該加上一層來保護這些對dlclose的使用

***** calling out to foreign procedures

      #+begin_src scheme
      (import (ikarus foreign))


      ((make-c-callout return-type parameter-types) native-pointer)


      (define libm (dlopen &quot;/lib/libm.so&quot;))
      libm
      ;; #&lt;pointer #x00007FE9413F19B0&gt;
      (define libm-atan-ptr (dlsym libc &quot;atan&quot;))
      libc-atan-ptr
      ;; #&lt;pointer #x00007FE940A6A730&gt;
      (define libm-atan
        ((make-c-callout &apos;double &apos;(double)) libm-atan-ptr))
      libm-atan

      (libm-atan 1.0)
      ;; 0.7853981633974483
      (libm-atan 1)
      ;; Unhandled exception
      ;;  Condition components:
      ;;     1. &amp;assertion
      ;;     2. &amp;who: callout-procedure
      ;;     3. &amp;message: &quot;argument does not match type double&quot;
      ;;     4. &amp;irritants: (1)
      #+end_src

***** calling back to scheme

      #+begin_src scheme
      (import (ikarus foreign))


      ((make-c-callback return-type parameter-types) scheme-procedure)


      ;; The following segment illustrates a very inefficient way of
      ;; extracting the lowermost 32 bits from an exact integer
      (format &quot;~x&quot;
              (((make-c-callout &apos;unsigned-int &apos;(unsigned-int))
                ((make-c-callback &apos;unsigned-int &apos;(unsigned-int))
                 values))
               #xfedcba09876543210fedcba09876543210))
      ;; &quot;76543210&quot;
      #+end_src
</pre>
</body>
</html>
